#5
"""Создайте простую веб-страницу для представления вашего любимого книжного произведения.
Используйте HTML для структуры и оформления текста.
Создайте базовую структуру HTML-страницы:
Добавьте теги <html>, <head> и <body>.
В <head> укажите заголовок страницы с названием вашего любимого произведения.
Разделите текст на следующие секции:
Введение: краткое описание произведения и его автора.
Основная часть: извлеките несколько цитат или ключевых моментов из книги.
Заключение: поделитесь своими мыслями о произведении.
Используйте различные HTML-теги для оформления текста:

Заголовки <h1>, <h2>, <h3> для разделов.
Параграфы <p> для текста.
Выделите ключевые фразы с помощью тега <strong> или <em>.
Добавьте изображение обложки книги:

Используйте тег <img> для вставки изображения.
Укажите атрибут src для пути к изображению.
Добавьте ссылку на страницу автора или на официальный сайт произведения:

Используйте тег <a> для создания ссылки.
Укажите атрибут href для указания URL.
"""